[
  {
    "id": 1,
    "name": "Потрібний смартфон?",
    "descr": "Сьогодні, смартфони користуються найбільшим попитом, але деяким людям вони не потрібні. Особливо, якщо критична автономна робота, або ударостійкість.",
    "yes_id": 2,
    "no_id": 13,
    "phone_yes": null,
    "phone_no": null
  },
  {
    "id":2,
    "name": "Потрібна фізична клавіатура?",
    "descr": "Хоча й мало хто користується фізичними клавіатурами, але такий спосіб набору тексту є найзручнішим та найшвидшим.",
    "yes_id": 3,
    "no_id": 4,
    "phone_yes": null,
    "phone_no": null
  },
  {
    "id": 3,
    "name": "Андроїд?",
    "descr": "Операційна система Android - найпопулярніша мобільна система в світі, що має багато користувачів та розробників. При виборі варіанту \"Ні\" буде обрано операційну систему Symbian. Телефони на базі цієй системи давно не випускаються, але досі користуються деякою популярністю.",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 0,
    "phone_no": 1
  },
  {
    "id": 4,
    "name": "Великий екран?",
    "descr": "Великим екраном вважається діагональ від 4 дюймів. Чим більше екран, тим більше споживання заряду батареї та складніше тримати телефон однією рукою. Але є багато переваг, наприклад: більш реалістичне зображення та практичність, що дозволяє дивитись відео не напрягаючи зір.",
    "yes_id": 5,
    "no_id": 11,
    "phone_yes": null,
    "phone_no": null
  },
  {
    "id": 5,
    "name": "Преміум сегмент?",
    "descr": "До преміум сегменту відносяться телефони з ціною більше 15 тисяч гривень. В флагманьских пристроях завжди кращі екрани, камери та багато можливостей, таких як NFC чи цифрова стабілізація камери.",
    "yes_id": 6,
    "no_id": 7,
    "phone_yes": null,
    "phone_no": null
  },
  {
    "id": 6,
    "name": "Андроїд?",
    "descr": "Флагманські телефони можуть бути лише на двух операційних системах - Android чи iOS від компанії Apple. Перші звичайно обираються, якщо потрібна можливість кастомізації інтерфейсу чи велика кількість програм.",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 2,
    "phone_no": 3
  },
  {
    "id": 7,
    "name": "Бюджетний?",
    "descr": "До бюджетних телефонів відносяться пристрої ціною нижче 5 тисяч гривень. Звичайно вони комплектуються досить посередньою камерою та екраном та операційною системою Android, але вони коштують достатньо недорого для населення",
    "yes_id": 8,
    "no_id": 9,
    "phone_yes": null,
    "phone_no": null
  },
  {
    "id": 8,
    "name": "Процесор Qualcomm?",
    "descr": "Процесори Qualcomm Snapdragon є одними з найпоширених у світі. Вони мають досить хорошу енергоефективність та продуктивність. Але ще є інші процесори від компаній Mediatek чи Huawei (Kirin).",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 4,
    "phone_no": 5
  },
  {
    "id": 9,
    "name": "Важлива камера?",
    "descr": "Якісна камера важлива для людей, які займаються фотографією. Але такі телефони є досить дорогими для звичайної людини. Якісна камера характеризується кількістю модулів камери (в наші дні їх декілька), розміром та кількість пікселів, апертурою та характеристиками матриці.",
    "yes_id": 10,
    "no_id": null,
    "phone_yes": null,
    "phone_no": 6
  },
  {
    "id": 10,
    "name": "NFC?",
    "descr": "Near Fiald Communication - це технологія бездротової передачі даних малого радіусу дії. Використовується здебільшого для безконтактних платежів. В Україні це доволі розвинута технологія, багато мереж супермаркетів та магазинів подтримують цю технологію, але пристрої з модулем NFC коштують набагато дорожче.",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 7,
    "phone_no": 8
  },
  {
    "id": 11,
    "name": "Хороша камера?",
    "descr": "Телефони таких розмірів можуть комплектуватися досить непоганими камерами. Якщо Вам не потрібна камера, то мабуть вам важлива друга характеристика, така як клас захисту.",
    "yes_id": null,
    "no_id": 12,
    "phone_yes": 9,
    "phone_no": null
  },
  {
    "id": 12,
    "name": "Важливий клас захисту?",
    "descr": "Такі телефони використовуються людьми, які можуть працювати на підприємствах, де звичайні телефони можуть бути фізично пошкоджені, тому важливий захист (пилозахист, чи захист від падінь, чи, навіть, захист від колес автомобіля).",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 10,
    "phone_no": 11
  },
  {
    "id": 13,
    "name": "Важлива ударостійкість?",
    "descr": "Телефони з захистом від ударів користуються попитом у людей, які часто мандрують та потрібний захист від випадкового падіння чи подряпин. Але вони мають досить непрезентабельний вигляд.",
    "yes_id": 14,
    "no_id": 15,
    "phone_yes": null,
    "phone_no": null
  },
  {
    "id": 14,
    "name": "Водонепроникність?",
    "descr": "Телефони з захистом IP87 мають захист від проникнення води та можуть бути занурені в воду до трьх метрів та будуть неушкоджені.",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 12,
    "phone_no": 13
  },
  {
    "id": 15,
    "name": "Критичний час автономної роботи?",
    "descr": "Це телефони, які оснащені батареєю ємністю не менше 3500 mAh, що дозволяє їм працювати в режимі очукування від двох неділь, до більше місяця",
    "yes_id": null,
    "no_id": null,
    "phone_yes": 14,
    "phone_no": 15
  }
]
